CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_gpio.h
#define PD00_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN0  = 0)
#define PD00_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN0  = 1)
#define PD01_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN1  = 0)
#define PD01_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN1  = 1)
#define PD02_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN2  = 0)
#define PD02_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN2  = 1)
#define PD03_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN3  = 0)
#define PD03_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN3  = 1)
#define PD04_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN4  = 0)
#define PD04_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN4  = 1)
#define PD05_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN5  = 0)
#define PD05_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN5  = 1)
#define PD06_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN6  = 0)
#define PD06_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN6  = 1)
#define PD07_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN7  = 0)
#define PD07_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN7  = 1)
#define PD08_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN8  = 0)
#define PD08_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN8  = 1)
#define PD09_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN9  = 0)
#define PD09_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN9  = 1)
#define PD10_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN10 = 0)
#define PD10_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN10 = 1)
#define PD11_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN11 = 0)
#define PD11_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN11 = 1)
#define PD12_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN12 = 0)
#define PD12_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN12 = 1)
#define PD13_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN13 = 0)
#define PD13_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN13 = 1)
#define PD14_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN14 = 0)
#define PD14_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN14 = 1)
#define PD15_DIR_OUTPUT()                   (CW_GPIOD->DIR_f.PIN15 = 0)
#define PD15_DIR_INPUT()                    (CW_GPIOD->DIR_f.PIN15 = 1)

#define PF00_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN0  = 0)
#define PF00_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN0  = 1)
#define PF01_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN1  = 0)
#define PF01_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN1  = 1)
#define PF02_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN2  = 0)
#define PF02_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN2  = 1)
#define PF03_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN3  = 0)
#define PF03_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN3  = 1)
#define PF04_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN4  = 0)
#define PF04_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN4  = 1)
#define PF05_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN5  = 0)
#define PF05_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN5  = 1)
#define PF06_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN6  = 0)
#define PF06_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN6  = 1)
#define PF07_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN7  = 0)
#define PF07_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN7  = 1)
#define PF08_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN8  = 0)
#define PF08_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN8  = 1)
#define PF09_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN9  = 0)
#define PF09_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN9  = 1)
#define PF10_DIR_OUTPUT()                   (CW_GPIOF->DIR_f.PIN10 = 0)
#define PF10_DIR_INPUT()                    (CW_GPIOF->DIR_f.PIN10 = 1)

//============================================================
//push-pull or opendrain
#define PA00_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN0  = 0)
#define PA00_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN0  = 1)
#define PA01_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN1  = 0)
#define PA01_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN1  = 1)
#define PA02_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN2  = 0)
#define PA02_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN2  = 1)
#define PA03_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN3  = 0)
#define PA03_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN3  = 1)
#define PA04_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN4  = 0)
#define PA04_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN4  = 1)
#define PA05_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN5  = 0)
#define PA05_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN5  = 1)
#define PA06_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN6  = 0)
#define PA06_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN6  = 1)
#define PA07_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN7  = 0)
#define PA07_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN7  = 1)
#define PA08_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN8  = 0)
#define PA08_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN8  = 1)
#define PA09_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN9  = 0)
#define PA09_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN9  = 1)
#define PA10_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN10 = 0)
#define PA10_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN10 = 1)
#define PA11_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN11 = 0)
#define PA11_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN11 = 1)
#define PA12_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN12 = 0)
#define PA12_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN12 = 1)
#define PA13_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN13 = 0)
#define PA13_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN13 = 1)
#define PA14_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN14 = 0)
#define PA14_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN14 = 1)
#define PA15_PUSHPULL_ENABLE()              (CW_GPIOA->OPENDRAIN_f.PIN15 = 0)
#define PA15_OPENDRAIN_ENABLE()             (CW_GPIOA->OPENDRAIN_f.PIN15 = 1)

