CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_gpio.h
#define PB00_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN0  = 1)
#define PB00_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN0  = 0)
#define PB01_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN1  = 1)
#define PB01_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN1  = 0)
#define PB02_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN2  = 1)
#define PB02_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN2  = 0)
#define PB03_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN3  = 1)
#define PB03_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN3  = 0)
#define PB04_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN4  = 1)
#define PB04_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN4  = 0)
#define PB05_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN5  = 1)
#define PB05_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN5  = 0)
#define PB06_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN6  = 1)
#define PB06_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN6  = 0)
#define PB07_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN7  = 1)
#define PB07_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN7  = 0)
#define PB08_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN8  = 1)
#define PB08_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN8  = 0)
#define PB09_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN9  = 1)
#define PB09_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN9  = 0)
#define PB10_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN10 = 1)
#define PB10_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN10 = 0)
#define PB11_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN11 = 1)
#define PB11_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN11 = 0)
#define PB12_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN12 = 1)
#define PB12_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN12 = 0)
#define PB13_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN13 = 1)
#define PB13_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN13 = 0)
#define PB14_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN14 = 1)
#define PB14_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN14 = 0)
#define PB15_PDR_ENABLE()                   (CW_GPIOB->PDR_f.PIN15 = 1)
#define PB15_PDR_DISABLE()                  (CW_GPIOB->PDR_f.PIN15 = 0)

#define PC00_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN0  = 1)
#define PC00_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN0  = 0)
#define PC01_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN1  = 1)
#define PC01_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN1  = 0)
#define PC02_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN2  = 1)
#define PC02_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN2  = 0)
#define PC03_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN3  = 1)
#define PC03_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN3  = 0)
#define PC04_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN4  = 1)
#define PC04_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN4  = 0)
#define PC05_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN5  = 1)
#define PC05_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN5  = 0)
#define PC06_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN6  = 1)
#define PC06_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN6  = 0)
#define PC07_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN7  = 1)
#define PC07_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN7  = 0)
#define PC08_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN8  = 1)
#define PC08_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN8  = 0)
#define PC09_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN9  = 1)
#define PC09_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN9  = 0)
#define PC10_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN10 = 1)
#define PC10_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN10 = 0)
#define PC11_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN11 = 1)
#define PC11_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN11 = 0)
#define PC12_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN12 = 1)
#define PC12_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN12 = 0)
#define PC13_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN13 = 1)
#define PC13_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN13 = 0)
#define PC14_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN14 = 1)
#define PC14_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN14 = 0)
#define PC15_PDR_ENABLE()                   (CW_GPIOC->PDR_f.PIN15 = 1)
#define PC15_PDR_DISABLE()                  (CW_GPIOC->PDR_f.PIN15 = 0)

#define PD00_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN0  = 1)
#define PD00_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN0  = 0)
#define PD01_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN1  = 1)
#define PD01_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN1  = 0)
#define PD02_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN2  = 1)
#define PD02_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN2  = 0)
#define PD03_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN3  = 1)
#define PD03_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN3  = 0)
#define PD04_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN4  = 1)
#define PD04_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN4  = 0)
#define PD05_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN5  = 1)
#define PD05_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN5  = 0)
#define PD06_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN6  = 1)
#define PD06_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN6  = 0)
#define PD07_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN7  = 1)
#define PD07_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN7  = 0)
#define PD08_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN8  = 1)
#define PD08_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN8  = 0)
#define PD09_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN9  = 1)
#define PD09_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN9  = 0)
#define PD10_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN10 = 1)
#define PD10_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN10 = 0)
#define PD11_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN11 = 1)
#define PD11_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN11 = 0)
#define PD12_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN12 = 1)
#define PD12_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN12 = 0)
#define PD13_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN13 = 1)
#define PD13_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN13 = 0)
#define PD14_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN14 = 1)
#define PD14_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN14 = 0)
#define PD15_PDR_ENABLE()                   (CW_GPIOD->PDR_f.PIN15 = 1)
#define PD15_PDR_DISABLE()                  (CW_GPIOD->PDR_f.PIN15 = 0)

