CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_gpio.h
#define PF00_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR0  = 0)
#define PF00_AFx_AUTOTRIMETR()              (CW_GPIOF->AFRL_f.AFR0  = 1)
#define PF00_AFx_GTIM1CH2()                 (CW_GPIOF->AFRL_f.AFR0  = 2)
#define PF00_AFx_I2C1SDA()                  (CW_GPIOF->AFRL_f.AFR0  = 3)
#define PF00_AFx_BTIM1TOGP()                (CW_GPIOF->AFRL_f.AFR0  = 4)
#define PF00_AFx_SPI2SCK()                  (CW_GPIOF->AFRL_f.AFR0  = 5)
#define PF00_AFx_GTIM2TOGN()                (CW_GPIOF->AFRL_f.AFR0  = 6)
#define PF00_AFx_GTIM3CH3()                 (CW_GPIOF->AFRL_f.AFR0  = 7)
#define PF01_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR1  = 0)
#define PF01_AFx_LSEOUT()                   (CW_GPIOF->AFRL_f.AFR1  = 1)
#define PF01_AFx_GTIM1CH1()                 (CW_GPIOF->AFRL_f.AFR1  = 2)
#define PF01_AFx_I2C1SCL()                  (CW_GPIOF->AFRL_f.AFR1  = 3)
#define PF01_AFx_BTIM1TOGN()                (CW_GPIOF->AFRL_f.AFR1  = 4)
#define PF01_AFx_SPI2CS()                   (CW_GPIOF->AFRL_f.AFR1  = 5)
#define PF01_AFx_GTIM2TOGP()                (CW_GPIOF->AFRL_f.AFR1  = 6)
#define PF01_AFx_GTIM3CH4()                 (CW_GPIOF->AFRL_f.AFR1  = 7)
#define PF04_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR4  = 0)
#define PF04_AFx_UART1TXD()                 (CW_GPIOF->AFRL_f.AFR4  = 1)
#define PF04_AFx_GTIM1CH2()                 (CW_GPIOF->AFRL_f.AFR4  = 2)
#define PF04_AFx_UART2RXD()                 (CW_GPIOF->AFRL_f.AFR4  = 4)
#define PF05_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR5  = 0)
#define PF05_AFx_UART1RXD()                 (CW_GPIOF->AFRL_f.AFR5  = 1)
#define PF05_AFx_BTIMETR()                  (CW_GPIOF->AFRL_f.AFR5  = 2)
#define PF05_AFx_UART2TXD()                 (CW_GPIOF->AFRL_f.AFR5  = 4)
#define PF05_AFx_AUTOTRIMETR()              (CW_GPIOF->AFRL_f.AFR5  = 5)
#define PF06_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR6  = 0)
#define PF06_AFx_UART3CTS()                 (CW_GPIOF->AFRL_f.AFR6  = 1)
#define PF06_AFx_I2C1SCL()                  (CW_GPIOF->AFRL_f.AFR6  = 2)
#define PF06_AFx_GTIM1TOGN()                (CW_GPIOF->AFRL_f.AFR6  = 3)
#define PF06_AFx_UART2CTS()                 (CW_GPIOF->AFRL_f.AFR6  = 4)
#define PF06_AFx_I2C2SCL()                  (CW_GPIOF->AFRL_f.AFR6  = 5)
#define PF06_AFx_GTIM3TOGN()                (CW_GPIOF->AFRL_f.AFR6  = 6)
#define PF06_AFx_BTIM3TOGP()                (CW_GPIOF->AFRL_f.AFR6  = 7)
#define PF07_AFx_GPIO()                     (CW_GPIOF->AFRL_f.AFR7  = 0)
#define PF07_AFx_UART3RTS()                 (CW_GPIOF->AFRL_f.AFR7  = 1)
#define PF07_AFx_I2C1SDA()                  (CW_GPIOF->AFRL_f.AFR7  = 2)
#define PF07_AFx_GTIM1TOGP()                (CW_GPIOF->AFRL_f.AFR7  = 3)
#define PF07_AFx_UART2RTS()                 (CW_GPIOF->AFRL_f.AFR7  = 4)
#define PF07_AFx_I2C2SDA()                  (CW_GPIOF->AFRL_f.AFR7  = 5)
#define PF07_AFx_GTIM3TOGP()                (CW_GPIOF->AFRL_f.AFR7  = 6)
#define PF07_AFx_BTIM3TOGN()                (CW_GPIOF->AFRL_f.AFR7  = 7)

//============================================================

#ifdef __cplusplus
}
#endif

#endif
